#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-0f83db7ad4345a260][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-026b3100fac5bed9e][0m
[0m[1maws_acm_certificate.ga_certificate: Refreshing state... [id=arn:aws:acm:ca-central-1:654654488989:certificate/d132e5b7-a968-4e3b-aa29-3967eb6540aa][0m
[0m[1maws_route53_zone.ga_zone: Refreshing state... [id=Z056957931UA8C0ZEYSRV][0m
[0m[1maws_ecs_cluster.ga_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:654654488989:cluster/ga-cluster-issue-7][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-08d7c28ee8c4c75ab][0m
[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0a150328d4a36cd79][0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Reading...[0m[0m
[0m[1maws_alb_target_group.ga_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:targetgroup/ga-issue-7-tg/580c079f302f9d50][0m
[0m[1maws_ecs_cluster_capacity_providers.ga_cluster_capacity_providers: Refreshing state... [id=ga-cluster-issue-7][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1113637547][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-2305692576][0m
[0m[1mdata.aws_subnets.app: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-602106889][0m
[0m[1mdata.aws_subnets.web: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.data: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-7-subnet-group][0m
[0m[1maws_lb.ga_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-issue-7-lb/2b2dbb892a420173][0m
[0m[1maws_route53_record.ga_record_cname["issue-7.ga-dev.bac-lac.ca"]: Refreshing state... [id=Z056957931UA8C0ZEYSRV__24d4fcb49a6e18bc2732d0320e66637e.issue-7.ga-dev.bac-lac.ca._CNAME][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog2: Refreshing state... [id=fsap-0ae76db52e67657d6][0m
[0m[1maws_efs_access_point.ga_ap_config1: Refreshing state... [id=fsap-06070ee746705414f][0m
[0m[1mdata.aws_route53_zone.ga_dev_zone: Read complete after 0s [id=Z10207542GS9DRXRUX91S][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0948d3afd3205ef93][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-0bfce07b2eb7a8cfb][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot2: Refreshing state... [id=fsap-0e10ad036b290d4b1][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver1: Refreshing state... [id=fsap-0360c823309cf0470][0m
[0m[1maws_efs_access_point.ga_ap_upgrader1: Refreshing state... [id=fsap-08eab5d665ff72e45][0m
[0m[1maws_efs_access_point.ga_ap_config2: Refreshing state... [id=fsap-0dc616195c7bd8877][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog1: Refreshing state... [id=fsap-05a4c3a52bbdc9547][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver2: Refreshing state... [id=fsap-08f69a04a9e50e36b][0m
[0m[1maws_efs_access_point.ga_ap_upgrader2: Refreshing state... [id=fsap-0a7e4164dbd4c5093][0m
[0m[1maws_efs_access_point.ga_ap_userdata: Refreshing state... [id=fsap-0e00b128b22042290][0m
[0m[1maws_efs_access_point.ga_ap_sharedconfig: Refreshing state... [id=fsap-05292a8e4dfc4be54][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-03ddffacd903ee941][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot1: Refreshing state... [id=fsap-01a13ba86f96590e9][0m
[0m[1maws_route53_record.ga_record_ns: Refreshing state... [id=Z10207542GS9DRXRUX91S_issue-7.ga-dev.bac-lac.ca_NS][0m
[0m[1maws_acm_certificate_validation.ga_certificate_validation: Refreshing state... [id=2024-05-22 19:39:06.941 +0000 UTC][0m
[0m[1maws_route53_record.ga_record_a: Refreshing state... [id=Z056957931UA8C0ZEYSRV_issue-7.ga-dev.bac-lac.ca_A][0m
[0m[1maws_alb_listener.ga_443: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-issue-7-lb/2b2dbb892a420173/e7966dbbc7ad6825][0m
[0m[1maws_alb_listener.http_80: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:listener/app/ga-issue-7-lb/2b2dbb892a420173/8d010979c0888bd2][0m
[0m[1maws_ecs_task_definition.ga_task_definition: Refreshing state... [id=ga-task-definition-issue-7][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-UZVOZ4O7HHD52URXRBVIZSQJH4][0m
[0m[1maws_ecs_service.ga_service: Refreshing state... [id=arn:aws:ecs:ca-central-1:654654488989:service/ga-cluster-issue-7/ga-service-issue-7][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_ecs_service.ga_service[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "ga_service" {
        id                                 = "arn:aws:ecs:ca-central-1:654654488989:service/ga-cluster-issue-7/ga-service-issue-7"
        name                               = (sensitive value)
        tags                               = {}
      [33m~[0m[0m task_definition                    = "arn:aws:ecs:ca-central-1:654654488989:task-definition/ga-task-definition-issue-7:6" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_ecs_task_definition.ga_task_definition[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "ga_task_definition" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:ca-central-1:654654488989:task-definition/ga-task-definition-issue-7:6" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:ca-central-1:654654488989:task-definition/ga-task-definition-issue-7" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [33m~[0m[0m image            = "helpsystems/goanywhere-mft" [33m->[0m[0m "public.ecr.aws/t3j9o2u0/mft"
                    name             = "mft1"
                  [33m~[0m[0m portMappings     = [
                      [33m~[0m[0m {
                          [31m-[0m[0m hostPort      = 8000
                            name          = "mft1-8000-tcp"
                            [90m# (3 unchanged attributes hidden)[0m[0m
                        },
                    ]
                    [90m# (8 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m id                       = "ga-task-definition-issue-7" -> (known after apply)
      [33m~[0m[0m revision                 = 6 -> (known after apply)
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all                 = {} -> (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*